MikroElektronika/core_packages/PIC/XC8/def/PIC16F1719/mcu.h
extern volatile SLRCONCbits_t SLRCONCbits __at(0x30E);
// bitfield macros
#define _SLRCONC_SLRC0_POSN                                 0x0
#define _SLRCONC_SLRC0_POSITION                             0x0
#define _SLRCONC_SLRC0_SIZE                                 0x1
#define _SLRCONC_SLRC0_LENGTH                               0x1
#define _SLRCONC_SLRC0_MASK                                 0x1
#define _SLRCONC_SLRC1_POSN                                 0x1
#define _SLRCONC_SLRC1_POSITION                             0x1
#define _SLRCONC_SLRC1_SIZE                                 0x1
#define _SLRCONC_SLRC1_LENGTH                               0x1
#define _SLRCONC_SLRC1_MASK                                 0x2
#define _SLRCONC_SLRC2_POSN                                 0x2
#define _SLRCONC_SLRC2_POSITION                             0x2
#define _SLRCONC_SLRC2_SIZE                                 0x1
#define _SLRCONC_SLRC2_LENGTH                               0x1
#define _SLRCONC_SLRC2_MASK                                 0x4
#define _SLRCONC_SLRC3_POSN                                 0x3
#define _SLRCONC_SLRC3_POSITION                             0x3
#define _SLRCONC_SLRC3_SIZE                                 0x1
#define _SLRCONC_SLRC3_LENGTH                               0x1
#define _SLRCONC_SLRC3_MASK                                 0x8
#define _SLRCONC_SLRC4_POSN                                 0x4
#define _SLRCONC_SLRC4_POSITION                             0x4
#define _SLRCONC_SLRC4_SIZE                                 0x1
#define _SLRCONC_SLRC4_LENGTH                               0x1
#define _SLRCONC_SLRC4_MASK                                 0x10
#define _SLRCONC_SLRC5_POSN                                 0x5
#define _SLRCONC_SLRC5_POSITION                             0x5
#define _SLRCONC_SLRC5_SIZE                                 0x1
#define _SLRCONC_SLRC5_LENGTH                               0x1
#define _SLRCONC_SLRC5_MASK                                 0x20
#define _SLRCONC_SLRC6_POSN                                 0x6
#define _SLRCONC_SLRC6_POSITION                             0x6
#define _SLRCONC_SLRC6_SIZE                                 0x1
#define _SLRCONC_SLRC6_LENGTH                               0x1
#define _SLRCONC_SLRC6_MASK                                 0x40
#define _SLRCONC_SLRC7_POSN                                 0x7
#define _SLRCONC_SLRC7_POSITION                             0x7
#define _SLRCONC_SLRC7_SIZE                                 0x1
#define _SLRCONC_SLRC7_LENGTH                               0x1
#define _SLRCONC_SLRC7_MASK                                 0x80

// Register: SLRCOND
#define SLRCOND SLRCOND
extern volatile unsigned char           SLRCOND             __at(0x30F);
#ifndef _LIB_BUILD
asm("SLRCOND equ 030Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRD0                  :1;
        unsigned SLRD1                  :1;
        unsigned SLRD2                  :1;
        unsigned SLRD3                  :1;
        unsigned SLRD4                  :1;
        unsigned SLRD5                  :1;
        unsigned SLRD6                  :1;
        unsigned SLRD7                  :1;
    };
} SLRCONDbits_t;
extern volatile SLRCONDbits_t SLRCONDbits __at(0x30F);
// bitfield macros
#define _SLRCOND_SLRD0_POSN                                 0x0
#define _SLRCOND_SLRD0_POSITION                             0x0
#define _SLRCOND_SLRD0_SIZE                                 0x1
#define _SLRCOND_SLRD0_LENGTH                               0x1
#define _SLRCOND_SLRD0_MASK                                 0x1
#define _SLRCOND_SLRD1_POSN                                 0x1
#define _SLRCOND_SLRD1_POSITION                             0x1
#define _SLRCOND_SLRD1_SIZE                                 0x1
#define _SLRCOND_SLRD1_LENGTH                               0x1
#define _SLRCOND_SLRD1_MASK                                 0x2
#define _SLRCOND_SLRD2_POSN                                 0x2
#define _SLRCOND_SLRD2_POSITION                             0x2
#define _SLRCOND_SLRD2_SIZE                                 0x1
#define _SLRCOND_SLRD2_LENGTH                               0x1
#define _SLRCOND_SLRD2_MASK                                 0x4
#define _SLRCOND_SLRD3_POSN                                 0x3
#define _SLRCOND_SLRD3_POSITION                             0x3
#define _SLRCOND_SLRD3_SIZE                                 0x1
#define _SLRCOND_SLRD3_LENGTH                               0x1
#define _SLRCOND_SLRD3_MASK                                 0x8
#define _SLRCOND_SLRD4_POSN                                 0x4
#define _SLRCOND_SLRD4_POSITION                             0x4
#define _SLRCOND_SLRD4_SIZE                                 0x1
#define _SLRCOND_SLRD4_LENGTH                               0x1
#define _SLRCOND_SLRD4_MASK                                 0x10
#define _SLRCOND_SLRD5_POSN                                 0x5
#define _SLRCOND_SLRD5_POSITION                             0x5
#define _SLRCOND_SLRD5_SIZE                                 0x1
#define _SLRCOND_SLRD5_LENGTH                               0x1
#define _SLRCOND_SLRD5_MASK                                 0x20
#define _SLRCOND_SLRD6_POSN                                 0x6
#define _SLRCOND_SLRD6_POSITION                             0x6
#define _SLRCOND_SLRD6_SIZE                                 0x1
#define _SLRCOND_SLRD6_LENGTH                               0x1
#define _SLRCOND_SLRD6_MASK                                 0x40
#define _SLRCOND_SLRD7_POSN                                 0x7
#define _SLRCOND_SLRD7_POSITION                             0x7
#define _SLRCOND_SLRD7_SIZE                                 0x1
#define _SLRCOND_SLRD7_LENGTH                               0x1
#define _SLRCOND_SLRD7_MASK                                 0x80

// Register: SLRCONE
#define SLRCONE SLRCONE
extern volatile unsigned char           SLRCONE             __at(0x310);
#ifndef _LIB_BUILD
asm("SLRCONE equ 0310h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRE0                  :1;
        unsigned SLRE1                  :1;
        unsigned SLRE2                  :1;
    };
} SLRCONEbits_t;
