MikroElektronika/core_packages/PIC/XC8/def/PIC16F1719/mcu.h
extern volatile __bit                   MLC3OUT             __at(0x787A);	// @ (0xF0F * 8 + 2)
#define                                 MLC3OUT_bit         _BIT_ACCESS(CLCDATA,2)
// CLCDATA<MLC4OUT>
extern volatile __bit                   MLC4OUT             __at(0x787B);	// @ (0xF0F * 8 + 3)
#define                                 MLC4OUT_bit         _BIT_ACCESS(CLCDATA,3)
// SSP1MSK<MSK0>
extern volatile __bit                   MSK0                __at(0x1098);	// @ (0x213 * 8 + 0)
#define                                 MSK0_bit            _BIT_ACCESS(SSP1MSK,0)
// SSP1MSK<MSK1>
extern volatile __bit                   MSK1                __at(0x1099);	// @ (0x213 * 8 + 1)
#define                                 MSK1_bit            _BIT_ACCESS(SSP1MSK,1)
// SSP1MSK<MSK2>
extern volatile __bit                   MSK2                __at(0x109A);	// @ (0x213 * 8 + 2)
#define                                 MSK2_bit            _BIT_ACCESS(SSP1MSK,2)
// SSP1MSK<MSK3>
extern volatile __bit                   MSK3                __at(0x109B);	// @ (0x213 * 8 + 3)
#define                                 MSK3_bit            _BIT_ACCESS(SSP1MSK,3)
// SSP1MSK<MSK4>
extern volatile __bit                   MSK4                __at(0x109C);	// @ (0x213 * 8 + 4)
#define                                 MSK4_bit            _BIT_ACCESS(SSP1MSK,4)
// SSP1MSK<MSK5>
extern volatile __bit                   MSK5                __at(0x109D);	// @ (0x213 * 8 + 5)
#define                                 MSK5_bit            _BIT_ACCESS(SSP1MSK,5)
// SSP1MSK<MSK6>
extern volatile __bit                   MSK6                __at(0x109E);	// @ (0x213 * 8 + 6)
#define                                 MSK6_bit            _BIT_ACCESS(SSP1MSK,6)
// SSP1MSK<MSK7>
extern volatile __bit                   MSK7                __at(0x109F);	// @ (0x213 * 8 + 7)
#define                                 MSK7_bit            _BIT_ACCESS(SSP1MSK,7)
// NCO1CLK<N1CKS0>
extern volatile __bit                   N1CKS0              __at(0x24F8);	// @ (0x49F * 8 + 0)
#define                                 N1CKS0_bit          _BIT_ACCESS(NCO1CLK,0)
// NCO1CLK<N1CKS1>
extern volatile __bit                   N1CKS1              __at(0x24F9);	// @ (0x49F * 8 + 1)
#define                                 N1CKS1_bit          _BIT_ACCESS(NCO1CLK,1)
// NCO1CON<N1EN>
extern volatile __bit                   N1EN                __at(0x24F7);	// @ (0x49E * 8 + 7)
#define                                 N1EN_bit            _BIT_ACCESS(NCO1CON,7)
// NCO1CON<N1OUT>
extern volatile __bit                   N1OUT               __at(0x24F5);	// @ (0x49E * 8 + 5)
#define                                 N1OUT_bit           _BIT_ACCESS(NCO1CON,5)
// NCO1CON<N1PFM>
extern volatile __bit                   N1PFM               __at(0x24F0);	// @ (0x49E * 8 + 0)
#define                                 N1PFM_bit           _BIT_ACCESS(NCO1CON,0)
// NCO1CON<N1POL>
extern volatile __bit                   N1POL               __at(0x24F4);	// @ (0x49E * 8 + 4)
#define                                 N1POL_bit           _BIT_ACCESS(NCO1CON,4)
// NCO1CLK<N1PWS0>
extern volatile __bit                   N1PWS0              __at(0x24FD);	// @ (0x49F * 8 + 5)
#define                                 N1PWS0_bit          _BIT_ACCESS(NCO1CLK,5)
// NCO1CLK<N1PWS1>
extern volatile __bit                   N1PWS1              __at(0x24FE);	// @ (0x49F * 8 + 6)
#define                                 N1PWS1_bit          _BIT_ACCESS(NCO1CLK,6)
// NCO1CLK<N1PWS2>
extern volatile __bit                   N1PWS2              __at(0x24FF);	// @ (0x49F * 8 + 7)
#define                                 N1PWS2_bit          _BIT_ACCESS(NCO1CLK,7)
// NCO1ACCL<NCO1ACC0>
extern volatile __bit                   NCO1ACC0            __at(0x24C0);	// @ (0x498 * 8 + 0)
#define                                 NCO1ACC0_bit        _BIT_ACCESS(NCO1ACCL,0)
// NCO1ACCL<NCO1ACC1>
extern volatile __bit                   NCO1ACC1            __at(0x24C1);	// @ (0x498 * 8 + 1)
#define                                 NCO1ACC1_bit        _BIT_ACCESS(NCO1ACCL,1)
// NCO1ACCH<NCO1ACC10>
extern volatile __bit                   NCO1ACC10           __at(0x24CA);	// @ (0x499 * 8 + 2)
#define                                 NCO1ACC10_bit       _BIT_ACCESS(NCO1ACCH,2)
// NCO1ACCH<NCO1ACC11>
extern volatile __bit                   NCO1ACC11           __at(0x24CB);	// @ (0x499 * 8 + 3)
#define                                 NCO1ACC11_bit       _BIT_ACCESS(NCO1ACCH,3)
// NCO1ACCH<NCO1ACC12>
extern volatile __bit                   NCO1ACC12           __at(0x24CC);	// @ (0x499 * 8 + 4)
#define                                 NCO1ACC12_bit       _BIT_ACCESS(NCO1ACCH,4)
// NCO1ACCH<NCO1ACC13>
extern volatile __bit                   NCO1ACC13           __at(0x24CD);	// @ (0x499 * 8 + 5)
#define                                 NCO1ACC13_bit       _BIT_ACCESS(NCO1ACCH,5)
// NCO1ACCH<NCO1ACC14>
extern volatile __bit                   NCO1ACC14           __at(0x24CE);	// @ (0x499 * 8 + 6)
#define                                 NCO1ACC14_bit       _BIT_ACCESS(NCO1ACCH,6)
// NCO1ACCH<NCO1ACC15>
extern volatile __bit                   NCO1ACC15           __at(0x24CF);	// @ (0x499 * 8 + 7)
#define                                 NCO1ACC15_bit       _BIT_ACCESS(NCO1ACCH,7)
// NCO1ACCU<NCO1ACC16>
extern volatile __bit                   NCO1ACC16           __at(0x24D0);	// @ (0x49A * 8 + 0)
#define                                 NCO1ACC16_bit       _BIT_ACCESS(NCO1ACCU,0)
// NCO1ACCU<NCO1ACC17>
extern volatile __bit                   NCO1ACC17           __at(0x24D1);	// @ (0x49A * 8 + 1)
#define                                 NCO1ACC17_bit       _BIT_ACCESS(NCO1ACCU,1)
// NCO1ACCU<NCO1ACC18>
extern volatile __bit                   NCO1ACC18           __at(0x24D2);	// @ (0x49A * 8 + 2)
#define                                 NCO1ACC18_bit       _BIT_ACCESS(NCO1ACCU,2)
// NCO1ACCU<NCO1ACC19>
extern volatile __bit                   NCO1ACC19           __at(0x24D3);	// @ (0x49A * 8 + 3)
#define                                 NCO1ACC19_bit       _BIT_ACCESS(NCO1ACCU,3)
// NCO1ACCL<NCO1ACC2>
extern volatile __bit                   NCO1ACC2            __at(0x24C2);	// @ (0x498 * 8 + 2)
#define                                 NCO1ACC2_bit        _BIT_ACCESS(NCO1ACCL,2)
// NCO1ACCL<NCO1ACC3>
extern volatile __bit                   NCO1ACC3            __at(0x24C3);	// @ (0x498 * 8 + 3)
#define                                 NCO1ACC3_bit        _BIT_ACCESS(NCO1ACCL,3)
// NCO1ACCL<NCO1ACC4>
extern volatile __bit                   NCO1ACC4            __at(0x24C4);	// @ (0x498 * 8 + 4)
#define                                 NCO1ACC4_bit        _BIT_ACCESS(NCO1ACCL,4)
// NCO1ACCL<NCO1ACC5>
extern volatile __bit                   NCO1ACC5            __at(0x24C5);	// @ (0x498 * 8 + 5)
#define                                 NCO1ACC5_bit        _BIT_ACCESS(NCO1ACCL,5)
// NCO1ACCL<NCO1ACC6>
extern volatile __bit                   NCO1ACC6            __at(0x24C6);	// @ (0x498 * 8 + 6)
#define                                 NCO1ACC6_bit        _BIT_ACCESS(NCO1ACCL,6)
// NCO1ACCL<NCO1ACC7>
extern volatile __bit                   NCO1ACC7            __at(0x24C7);	// @ (0x498 * 8 + 7)
#define                                 NCO1ACC7_bit        _BIT_ACCESS(NCO1ACCL,7)
// NCO1ACCH<NCO1ACC8>
extern volatile __bit                   NCO1ACC8            __at(0x24C8);	// @ (0x499 * 8 + 0)
#define                                 NCO1ACC8_bit        _BIT_ACCESS(NCO1ACCH,0)
// NCO1ACCH<NCO1ACC9>
extern volatile __bit                   NCO1ACC9            __at(0x24C9);	// @ (0x499 * 8 + 1)
#define                                 NCO1ACC9_bit        _BIT_ACCESS(NCO1ACCH,1)
// NCO1INCL<NCO1INC0>
extern volatile __bit                   NCO1INC0            __at(0x24D8);	// @ (0x49B * 8 + 0)
#define                                 NCO1INC0_bit        _BIT_ACCESS(NCO1INCL,0)
// NCO1INCL<NCO1INC1>
extern volatile __bit                   NCO1INC1            __at(0x24D9);	// @ (0x49B * 8 + 1)
#define                                 NCO1INC1_bit        _BIT_ACCESS(NCO1INCL,1)
// NCO1INCH<NCO1INC10>
extern volatile __bit                   NCO1INC10           __at(0x24E2);	// @ (0x49C * 8 + 2)
#define                                 NCO1INC10_bit       _BIT_ACCESS(NCO1INCH,2)
// NCO1INCH<NCO1INC11>
extern volatile __bit                   NCO1INC11           __at(0x24E3);	// @ (0x49C * 8 + 3)
#define                                 NCO1INC11_bit       _BIT_ACCESS(NCO1INCH,3)
// NCO1INCH<NCO1INC12>
extern volatile __bit                   NCO1INC12           __at(0x24E4);	// @ (0x49C * 8 + 4)
#define                                 NCO1INC12_bit       _BIT_ACCESS(NCO1INCH,4)
// NCO1INCH<NCO1INC13>
extern volatile __bit                   NCO1INC13           __at(0x24E5);	// @ (0x49C * 8 + 5)
#define                                 NCO1INC13_bit       _BIT_ACCESS(NCO1INCH,5)
// NCO1INCH<NCO1INC14>
extern volatile __bit                   NCO1INC14           __at(0x24E6);	// @ (0x49C * 8 + 6)
#define                                 NCO1INC14_bit       _BIT_ACCESS(NCO1INCH,6)
// NCO1INCH<NCO1INC15>
extern volatile __bit                   NCO1INC15           __at(0x24E7);	// @ (0x49C * 8 + 7)
#define                                 NCO1INC15_bit       _BIT_ACCESS(NCO1INCH,7)
// NCO1INCU<NCO1INC16>
extern volatile __bit                   NCO1INC16           __at(0x24E8);	// @ (0x49D * 8 + 0)
#define                                 NCO1INC16_bit       _BIT_ACCESS(NCO1INCU,0)
// NCO1INCU<NCO1INC17>
extern volatile __bit                   NCO1INC17           __at(0x24E9);	// @ (0x49D * 8 + 1)
#define                                 NCO1INC17_bit       _BIT_ACCESS(NCO1INCU,1)
// NCO1INCU<NCO1INC18>
extern volatile __bit                   NCO1INC18           __at(0x24EA);	// @ (0x49D * 8 + 2)
#define                                 NCO1INC18_bit       _BIT_ACCESS(NCO1INCU,2)
// NCO1INCU<NCO1INC19>
extern volatile __bit                   NCO1INC19           __at(0x24EB);	// @ (0x49D * 8 + 3)
#define                                 NCO1INC19_bit       _BIT_ACCESS(NCO1INCU,3)
// NCO1INCL<NCO1INC2>
extern volatile __bit                   NCO1INC2            __at(0x24DA);	// @ (0x49B * 8 + 2)
#define                                 NCO1INC2_bit        _BIT_ACCESS(NCO1INCL,2)
// NCO1INCL<NCO1INC3>
extern volatile __bit                   NCO1INC3            __at(0x24DB);	// @ (0x49B * 8 + 3)
#define                                 NCO1INC3_bit        _BIT_ACCESS(NCO1INCL,3)
// NCO1INCL<NCO1INC4>
extern volatile __bit                   NCO1INC4            __at(0x24DC);	// @ (0x49B * 8 + 4)
#define                                 NCO1INC4_bit        _BIT_ACCESS(NCO1INCL,4)
// NCO1INCL<NCO1INC5>
extern volatile __bit                   NCO1INC5            __at(0x24DD);	// @ (0x49B * 8 + 5)
#define                                 NCO1INC5_bit        _BIT_ACCESS(NCO1INCL,5)
// NCO1INCL<NCO1INC6>
extern volatile __bit                   NCO1INC6            __at(0x24DE);	// @ (0x49B * 8 + 6)
#define                                 NCO1INC6_bit        _BIT_ACCESS(NCO1INCL,6)
// NCO1INCL<NCO1INC7>
extern volatile __bit                   NCO1INC7            __at(0x24DF);	// @ (0x49B * 8 + 7)
#define                                 NCO1INC7_bit        _BIT_ACCESS(NCO1INCL,7)
// NCO1INCH<NCO1INC8>
extern volatile __bit                   NCO1INC8            __at(0x24E0);	// @ (0x49C * 8 + 0)
#define                                 NCO1INC8_bit        _BIT_ACCESS(NCO1INCH,0)
// NCO1INCH<NCO1INC9>
extern volatile __bit                   NCO1INC9            __at(0x24E1);	// @ (0x49C * 8 + 1)
#define                                 NCO1INC9_bit        _BIT_ACCESS(NCO1INCH,1)
// PIE3<NCOIE>
extern volatile __bit                   NCOIE               __at(0x49E);	// @ (0x93 * 8 + 6)
#define                                 NCOIE_bit           _BIT_ACCESS(PIE3,6)
// PIR3<NCOIF>
extern volatile __bit                   NCOIF               __at(0x9E);	// @ (0x13 * 8 + 6)
#define                                 NCOIF_bit           _BIT_ACCESS(PIR3,6)
// DAC2CON0<NSS>
extern volatile __bit                   NSS                 __at(0x8D0);	// @ (0x11A * 8 + 0)
#define                                 NSS_bit             _BIT_ACCESS(DAC2CON0,0)
// ODCONA<ODA0>
extern volatile __bit                   ODA0                __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 ODA0_bit            _BIT_ACCESS(ODCONA,0)
// ODCONA<ODA1>
extern volatile __bit                   ODA1                __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 ODA1_bit            _BIT_ACCESS(ODCONA,1)
// ODCONA<ODA2>
extern volatile __bit                   ODA2                __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 ODA2_bit            _BIT_ACCESS(ODCONA,2)
// ODCONA<ODA3>
extern volatile __bit                   ODA3                __at(0x1463);	// @ (0x28C * 8 + 3)
#define                                 ODA3_bit            _BIT_ACCESS(ODCONA,3)
// ODCONA<ODA4>
extern volatile __bit                   ODA4                __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 ODA4_bit            _BIT_ACCESS(ODCONA,4)
// ODCONA<ODA5>
extern volatile __bit                   ODA5                __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 ODA5_bit            _BIT_ACCESS(ODCONA,5)
// ODCONA<ODA6>
extern volatile __bit                   ODA6                __at(0x1466);	// @ (0x28C * 8 + 6)
#define                                 ODA6_bit            _BIT_ACCESS(ODCONA,6)
// ODCONA<ODA7>
extern volatile __bit                   ODA7                __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 ODA7_bit            _BIT_ACCESS(ODCONA,7)
// ODCONB<ODB0>
extern volatile __bit                   ODB0                __at(0x1468);	// @ (0x28D * 8 + 0)
#define                                 ODB0_bit            _BIT_ACCESS(ODCONB,0)
// ODCONB<ODB1>
extern volatile __bit                   ODB1                __at(0x1469);	// @ (0x28D * 8 + 1)
#define                                 ODB1_bit            _BIT_ACCESS(ODCONB,1)
// ODCONB<ODB2>
extern volatile __bit                   ODB2                __at(0x146A);	// @ (0x28D * 8 + 2)
#define                                 ODB2_bit            _BIT_ACCESS(ODCONB,2)
// ODCONB<ODB3>
extern volatile __bit                   ODB3                __at(0x146B);	// @ (0x28D * 8 + 3)
#define                                 ODB3_bit            _BIT_ACCESS(ODCONB,3)
// ODCONB<ODB4>
extern volatile __bit                   ODB4                __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 ODB4_bit            _BIT_ACCESS(ODCONB,4)
// ODCONB<ODB5>
extern volatile __bit                   ODB5                __at(0x146D);	// @ (0x28D * 8 + 5)
#define                                 ODB5_bit            _BIT_ACCESS(ODCONB,5)
// ODCONB<ODB6>
extern volatile __bit                   ODB6                __at(0x146E);	// @ (0x28D * 8 + 6)
#define                                 ODB6_bit            _BIT_ACCESS(ODCONB,6)
// ODCONB<ODB7>
extern volatile __bit                   ODB7                __at(0x146F);	// @ (0x28D * 8 + 7)
#define                                 ODB7_bit            _BIT_ACCESS(ODCONB,7)
// ODCONC<ODC0>
extern volatile __bit                   ODC0                __at(0x1470);	// @ (0x28E * 8 + 0)
#define                                 ODC0_bit            _BIT_ACCESS(ODCONC,0)
// ODCONC<ODC1>
extern volatile __bit                   ODC1                __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 ODC1_bit            _BIT_ACCESS(ODCONC,1)
// ODCONC<ODC2>
extern volatile __bit                   ODC2                __at(0x1472);	// @ (0x28E * 8 + 2)
#define                                 ODC2_bit            _BIT_ACCESS(ODCONC,2)
// ODCONC<ODC3>
extern volatile __bit                   ODC3                __at(0x1473);	// @ (0x28E * 8 + 3)
#define                                 ODC3_bit            _BIT_ACCESS(ODCONC,3)
// ODCONC<ODC4>
extern volatile __bit                   ODC4                __at(0x1474);	// @ (0x28E * 8 + 4)
#define                                 ODC4_bit            _BIT_ACCESS(ODCONC,4)
// ODCONC<ODC5>
extern volatile __bit                   ODC5                __at(0x1475);	// @ (0x28E * 8 + 5)
#define                                 ODC5_bit            _BIT_ACCESS(ODCONC,5)
// ODCONC<ODC6>
extern volatile __bit                   ODC6                __at(0x1476);	// @ (0x28E * 8 + 6)
#define                                 ODC6_bit            _BIT_ACCESS(ODCONC,6)
// ODCONC<ODC7>
extern volatile __bit                   ODC7                __at(0x1477);	// @ (0x28E * 8 + 7)
#define                                 ODC7_bit            _BIT_ACCESS(ODCONC,7)
// ODCOND<ODD0>
extern volatile __bit                   ODD0                __at(0x1478);	// @ (0x28F * 8 + 0)
#define                                 ODD0_bit            _BIT_ACCESS(ODCOND,0)
// ODCOND<ODD1>
extern volatile __bit                   ODD1                __at(0x1479);	// @ (0x28F * 8 + 1)
#define                                 ODD1_bit            _BIT_ACCESS(ODCOND,1)
// ODCOND<ODD2>
extern volatile __bit                   ODD2                __at(0x147A);	// @ (0x28F * 8 + 2)
#define                                 ODD2_bit            _BIT_ACCESS(ODCOND,2)
// ODCOND<ODD3>
extern volatile __bit                   ODD3                __at(0x147B);	// @ (0x28F * 8 + 3)
#define                                 ODD3_bit            _BIT_ACCESS(ODCOND,3)
// ODCOND<ODD4>
extern volatile __bit                   ODD4                __at(0x147C);	// @ (0x28F * 8 + 4)
#define                                 ODD4_bit            _BIT_ACCESS(ODCOND,4)
// ODCOND<ODD5>
extern volatile __bit                   ODD5                __at(0x147D);	// @ (0x28F * 8 + 5)
#define                                 ODD5_bit            _BIT_ACCESS(ODCOND,5)
// ODCOND<ODD6>
extern volatile __bit                   ODD6                __at(0x147E);	// @ (0x28F * 8 + 6)
#define                                 ODD6_bit            _BIT_ACCESS(ODCOND,6)
// ODCOND<ODD7>
extern volatile __bit                   ODD7                __at(0x147F);	// @ (0x28F * 8 + 7)
#define                                 ODD7_bit            _BIT_ACCESS(ODCOND,7)
// ODCONE<ODE0>
extern volatile __bit                   ODE0                __at(0x1480);	// @ (0x290 * 8 + 0)
#define                                 ODE0_bit            _BIT_ACCESS(ODCONE,0)
// ODCONE<ODE1>
extern volatile __bit                   ODE1                __at(0x1481);	// @ (0x290 * 8 + 1)
#define                                 ODE1_bit            _BIT_ACCESS(ODCONE,1)
// ODCONE<ODE2>
extern volatile __bit                   ODE2                __at(0x1482);	// @ (0x290 * 8 + 2)
#define                                 ODE2_bit            _BIT_ACCESS(ODCONE,2)
// DAC2CON0<OE1>
extern volatile __bit                   OE1                 __at(0x8D5);	// @ (0x11A * 8 + 5)
#define                                 OE1_bit             _BIT_ACCESS(DAC2CON0,5)
// DAC2CON0<OE2>
extern volatile __bit                   OE2                 __at(0x8D4);	// @ (0x11A * 8 + 4)
#define                                 OE2_bit             _BIT_ACCESS(DAC2CON0,4)
// RC1STA<OERR>
extern volatile __bit                   OERR                __at(0xCE9);	// @ (0x19D * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RC1STA,1)
// OPA1CON<OPA1CH0>
extern volatile __bit                   OPA1CH0             __at(0x2888);	// @ (0x511 * 8 + 0)
#define                                 OPA1CH0_bit         _BIT_ACCESS(OPA1CON,0)
// OPA1CON<OPA1CH1>
extern volatile __bit                   OPA1CH1             __at(0x2889);	// @ (0x511 * 8 + 1)
#define                                 OPA1CH1_bit         _BIT_ACCESS(OPA1CON,1)
// OPA1CON<OPA1EN>
extern volatile __bit                   OPA1EN              __at(0x288F);	// @ (0x511 * 8 + 7)
#define                                 OPA1EN_bit          _BIT_ACCESS(OPA1CON,7)
// OPA1CON<OPA1PCH0>
extern volatile __bit                   OPA1PCH0            __at(0x2888);	// @ (0x511 * 8 + 0)
#define                                 OPA1PCH0_bit        _BIT_ACCESS(OPA1CON,0)
// OPA1CON<OPA1PCH1>
extern volatile __bit                   OPA1PCH1            __at(0x2889);	// @ (0x511 * 8 + 1)
#define                                 OPA1PCH1_bit        _BIT_ACCESS(OPA1CON,1)
// OPA1CON<OPA1SP>
extern volatile __bit                   OPA1SP              __at(0x288E);	// @ (0x511 * 8 + 6)
#define                                 OPA1SP_bit          _BIT_ACCESS(OPA1CON,6)
// OPA1CON<OPA1UG>
extern volatile __bit                   OPA1UG              __at(0x288C);	// @ (0x511 * 8 + 4)
#define                                 OPA1UG_bit          _BIT_ACCESS(OPA1CON,4)
// OPA2CON<OPA2CH0>
extern volatile __bit                   OPA2CH0             __at(0x28A8);	// @ (0x515 * 8 + 0)
#define                                 OPA2CH0_bit         _BIT_ACCESS(OPA2CON,0)
// OPA2CON<OPA2CH1>
extern volatile __bit                   OPA2CH1             __at(0x28A9);	// @ (0x515 * 8 + 1)
#define                                 OPA2CH1_bit         _BIT_ACCESS(OPA2CON,1)
// OPA2CON<OPA2EN>
extern volatile __bit                   OPA2EN              __at(0x28AF);	// @ (0x515 * 8 + 7)
#define                                 OPA2EN_bit          _BIT_ACCESS(OPA2CON,7)
// OPA2CON<OPA2PCH0>
extern volatile __bit                   OPA2PCH0            __at(0x28A8);	// @ (0x515 * 8 + 0)
#define                                 OPA2PCH0_bit        _BIT_ACCESS(OPA2CON,0)
// OPA2CON<OPA2PCH1>
extern volatile __bit                   OPA2PCH1            __at(0x28A9);	// @ (0x515 * 8 + 1)
#define                                 OPA2PCH1_bit        _BIT_ACCESS(OPA2CON,1)
// OPA2CON<OPA2SP>
extern volatile __bit                   OPA2SP              __at(0x28AE);	// @ (0x515 * 8 + 6)
#define                                 OPA2SP_bit          _BIT_ACCESS(OPA2CON,6)
// OPA2CON<OPA2UG>
extern volatile __bit                   OPA2UG              __at(0x28AC);	// @ (0x515 * 8 + 4)
#define                                 OPA2UG_bit          _BIT_ACCESS(OPA2CON,4)
// PIE2<OSFIE>
extern volatile __bit                   OSFIE               __at(0x497);	// @ (0x92 * 8 + 7)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE2,7)
// PIR2<OSFIF>
extern volatile __bit                   OSFIF               __at(0x97);	// @ (0x12 * 8 + 7)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR2,7)
// OSCSTAT<OSTS>
extern volatile __bit                   OSTS                __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 OSTS_bit            _BIT_ACCESS(OSCSTAT,5)
// CCPTMRS<P3TSEL0>
extern volatile __bit                   P3TSEL0             __at(0x14F4);	// @ (0x29E * 8 + 4)
#define                                 P3TSEL0_bit         _BIT_ACCESS(CCPTMRS,4)
// CCPTMRS<P3TSEL1>
extern volatile __bit                   P3TSEL1             __at(0x14F5);	// @ (0x29E * 8 + 5)
#define                                 P3TSEL1_bit         _BIT_ACCESS(CCPTMRS,5)
// CCPTMRS<P4TSEL0>
extern volatile __bit                   P4TSEL0             __at(0x14F6);	// @ (0x29E * 8 + 6)
#define                                 P4TSEL0_bit         _BIT_ACCESS(CCPTMRS,6)
// CCPTMRS<P4TSEL1>
extern volatile __bit                   P4TSEL1             __at(0x14F7);	// @ (0x29E * 8 + 7)
#define                                 P4TSEL1_bit         _BIT_ACCESS(CCPTMRS,7)
// SSP1CON3<PCIE>
extern volatile __bit                   PCIE                __at(0x10BE);	// @ (0x217 * 8 + 6)
#define                                 PCIE_bit            _BIT_ACCESS(SSP1CON3,6)
